# RT-DETR with MobileNetV3-Small backbone (MODERATE - Optimized for Speed)
# Lightweight transformer detector for mobile/edge deployment

nc: 5  # number of classes

# MobileNetV3-Small inspired backbone
backbone:
  # Stem
  - [-1, 1, Conv, [16, 3, 2]]          # 0 - P1/2

  # Stage 1 - MobileNet blocks with depthwise separable convs
  - [-1, 1, DWConv, [16, 3, 1]]        # 1
  - [-1, 1, Conv, [16, 1, 1]]          # 2

  # Stage 2
  - [-1, 1, Conv, [64, 1, 1]]          # 3 - expand
  - [-1, 1, DWConv, [64, 3, 2]]        # 4 - P2/4
  - [-1, 1, Conv, [24, 1, 1]]          # 5 - project

  # Stage 3
  - [-1, 1, Conv, [72, 1, 1]]          # 6
  - [-1, 1, DWConv, [72, 3, 1]]        # 7
  - [-1, 1, Conv, [24, 1, 1]]          # 8

  # Stage 4 - P3/8
  - [-1, 1, Conv, [72, 1, 1]]          # 9
  - [-1, 1, DWConv, [72, 5, 2]]        # 10 - P3/8
  - [-1, 1, Conv, [40, 1, 1]]          # 11
  - [-1, 1, C2f, [40]]                 # 12 (was 2)

  # Stage 5 - P4/16
  - [-1, 1, Conv, [120, 1, 1]]         # 13
  - [-1, 1, DWConv, [120, 5, 2]]       # 14 - P4/16
  - [-1, 1, Conv, [80, 1, 1]]          # 15
  - [-1, 2, C2f, [80]]                 # 16 (was 3)

  # Stage 6 - P5/32
  - [-1, 1, Conv, [240, 1, 1]]         # 17
  - [-1, 1, DWConv, [240, 5, 2]]       # 18 - P5/32
  - [-1, 1, Conv, [160, 1, 1]]         # 19
  - [-1, 1, C2f, [160]]                # 20 (was 2)

head:
  # RT-DETR Hybrid Encoder - project P5 features
  - [-1, 1, Conv, [256, 1, 1]]                             # 21 - input proj
  - [-1, 1, AIFI, [512, 4]]                                # 22 - AIFI transformer (was 1024, 8)
  - [-1, 1, Conv, [256, 1, 1]]                             # 23 - output proj

  # Top-down path - upsample and fuse with P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]             # 24 - upsample
  - [16, 1, Conv, [256, 1, 1]]                             # 25 - project P4 (layer 16)
  - [[-2, -1], 1, Concat, [1]]                             # 26 - concat
  - [-1, 2, RepC3, [256]]                                  # 27 - fuse (was 3)

  # Top-down path - upsample and fuse with P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]             # 28 - upsample
  - [12, 1, Conv, [256, 1, 1]]                             # 29 - project P3 (layer 12)
  - [[-2, -1], 1, Concat, [1]]                             # 30 - concat
  - [-1, 2, RepC3, [256]]                                  # 31 - fpn_out0 (P3) (was 3)

  # Bottom-up path
  - [-1, 1, Conv, [256, 3, 2]]                             # 32 - downsample
  - [[-1, 27], 1, Concat, [1]]                             # 33 - concat with P4 features
  - [-1, 2, RepC3, [256]]                                  # 34 - fpn_out1 (P4) (was 3)

  - [-1, 1, Conv, [256, 3, 2]]                             # 35 - downsample
  - [[-1, 23], 1, Concat, [1]]                             # 36 - concat with P5 features
  - [-1, 2, RepC3, [256]]                                  # 37 - fpn_out2 (P5) (was 3)

  # RT-DETR Decoder
  - [[31, 34, 37], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # 38 - Decoder
